Revit 2027 API
ReinforcementAbbreviationObjectType Enumeration
 Defines the type of desired reinforcement object for abbreviation tags.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ReinforcementAbbreviationObjectType
Public Enumeration ReinforcementAbbreviationObjectType
public enum class ReinforcementAbbreviationObjectType
type ReinforcementAbbreviationObjectType
Members
Member name | Value | Description
Area | 0 |  Abbreviation tags for Area Reinforcement.
Path | 1 |  Abbreviation tags for Path Reinforcement.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace